han0519/esp32-s31-vocat/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024

CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=2048

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# PSRAM (external SPI RAM, required by RGB LCD frame buffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y

# S31 qacc (WakeNet/DSP) cannot access LP/RTC fast RAM (0x2E); keeping it out of
# the MALLOC_CAP_INTERNAL heap forces SR activation buffers into internal SRAM
# (0x2F) where the qacc bus can reach them. Without this, wakenet crashes with a
# Load access fault reading 0x2e00xxxx during model_run.
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n

# Watchdog timeout 30s: at boot (wifi connect + camera + audio + emote all
# starting on CPU0) the IDLE0 task can be starved >10s, tripping the old 10s
# timeout and rebooting right after WiFi connects. 30s covers the startup burst.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y

# These entries are copied from ESP-HI (ESP32C3) to reduce memory usage
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n

CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# Fix ML307 FIFO Overflow
CONFIG_UART_ISR_IN_IRAM=y

# LVGL 9.2.2
# Enable LVGL adapter FS so EAF assets can be mounted (esp_lv_adapter_fs_mount)
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FS=y

CONFIG_LV_OS_NONE=y
CONFIG_LV_USE_OS=0
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_USE_IMGFONT=y

# Use compressed font
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_FONT_PLACEHOLDER=y

# Enable Chinese font support (Source Han Sans SC CJK)
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_14_CJK=y
CONFIG_LV_FONT_DEFAULT_SOURCE_HAN_SANS_SC_14_CJK=y

# Disable extra widgets to save flash size
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CALENDAR_HEADER_ARROW=n
CONFIG_LV_USE_CALENDAR_HEADER_DROPDOWN=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n

CONFIG_LV_BUILD_EXAMPLES=n

# Rendering performance: circle cache for the round 360x360 screen.
# NOTE: LVGL's PPA draw unit (LV_USE_PPA) was evaluated but the component
# manager cannot resolve lvgl's PPA dependency on this managed-component setup
# ("component_requirements.py cannot match lvgl__lvgl") — reverting to the
# stable software render baseline. RISC-V V blend is C emulation (no gain).
CONFIG_LV_DRAW_SW_CIRCLE_CACHE_SIZE=8

# lwIP: SACK improves throughput on lossy Wi-Fi; larger send/recv windows help
# the MJPEG preview stream and websocket audio move larger bursts per ACK.
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192
CONFIG_TCP_SND_BUF_DEFAULT=8192

# Official emote engine: make the toast caption under the face wide enough to
# show a full sentence scrolling, positioned below the eyes.
CONFIG_EMOTE_DEF_SCROLL_SPEED=40
CONFIG_EMOTE_DEF_LABEL_WIDTH=340
CONFIG_EMOTE_DEF_LABEL_Y_OFFSET=268

CONFIG_VOICE_WAKEUP_MODE=y
CONFIG_AUDIO_AFE_ENABLE=y
CONFIG_SR_WN_WN9_NIHAOMIAOBAN_TTS2=y
CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y

# Xiaozhi Chat Application: use WebSocket transport (same domain as OTA,
# so the default cert bundle validates it; MQTT endpoint uses a different CA
# not in the bundle and fails the TLS handshake).
CONFIG_XIAOZHI_CHAT_APP_TRANSPORT_WEBSOCKET=y

# Camera: SC101IOT DVP (P1 FPC) + S31 hardware JPEG encoder (/dev/video10).
CONFIG_ESP_BOARD_DEV_CAMERA_SUPPORT=y
CONFIG_CAMERA_SC101IOT=y
CONFIG_CAMERA_SC101IOT_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
CONFIG_CAMERA_XCLK_USE_LEDC=y
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_ENC_VIDEO_DEVICE=y

# Wi-Fi (protocol_examples_common)
CONFIG_EXAMPLE_WIFI_SSID="HONOR"
CONFIG_EXAMPLE_WIFI_PASSWORD="JIN060519"

# Bluetooth A2DP sink (classic BR/EDR only; no esp_bt_controller_mem_release,
# which previously crashed the S31 controller). BLE kept off to save RAM; the
# app does not use BLE. S31 controller support requires ESP-IDF >= 08e0d30a.
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_BLE_ENABLED=n
